[
    {
        "code":"CST300",
        "title": "Major ProSeminar",
        "description": "The class was dedicated to exploring technological trends, and figuring out how the education we are getting is going to meet the requirements of those trends.", 
        "projects": [
            "https://www.youtube.com/watch?v=Ni_IDKWaYb8",
            "src/assets/PMejiaDeepFakeEssay.pdf",
            "src/assets/PMejiaSWEEssay.pdf"
        ]
    },
    {
        "code":"CST338",
        "title": "Software Design",
        "description": "This is an intermediate-level programming course covering techniques for developing large-scale software systems using object-oriented programming. Coverage includes software development life cycle models, requirements analysis, and graphical user interface development." 
    },
    {
        "code":"CST311",
        "title": " Introduction to Computer Networks",
        "description": "Survey of Telecomm and Data Comm Technology Fundamentals, Local Area Network, Wide Area Network, Internet and internetworking protocols including TCP/IP, network security and performance, emerging industry trends such as voice over the network and high speed networking." 
    },
    {
        "code":"CST334",
        "title": "Operating Systems",
        "description": "CST 334 - Operating Systems taught about the use and design of modern operating systems, focusing on Linux. " 
    },
    {
        "code":"CST336",
        "title": "Internet Programming",
        "description": "CST336 - Internet Programming taught full-stack development using technologies like NodeJS, HTML, and CSS. The class also introduced 3d-party API integration into development." 
    },
    {
        "code":"CST363",
        "title": "Introduction to Database Systems",
        "description": "The class taught simple SQL database queries, RDBMS, database schemas, and backend implementation with SpringBoot." 
    },
    {
        "code":"CST383",
        "title": "Introduction to Data Science",
        "description": "Introduction to Data Science taught advanced use cases for python data science libraries such as pandas and numpy. We had the opportunity to learn Machine Learning algorithms such as KNN, Linear Regression, Decision Trees, and more." 
    },
    {
        "code":"CST328",
        "title": "Digital Art and Design",
        "description": "CST 328 - Digital Art and Design taught the basics of color theory, the psychology behind colors, and what use cases would fit best for the type of service. Practiced applying the skills with tools like Figma, Unity, and Photoshop. " 
    },
    {
        "code":"CST370",
        "title": "Design and Analysis of Algorithms",
        "description": "Design and Analysis of Algorithms taught common algorithms needed to successfully tackle most Leetcode-like programmatic problems." 
    },
    {
        "code":"CST438",
        "title": "Software Engineering",
        "description": "CST 438 - Software Engineering involved learning about best software engineering practices as well as practicing the learned paradigms in an applied setting." 
    },
    {
        "code":"CST462S",
        "title": "Race, Gender, Class in the Digital World",
        "description": "The class dedicated to exploring social trends, and figuring out how the education we are getting is going affect and/or improve the state of those trends." 
    },
    {
        "code":"CST489",
        "title": "Capstone Project Planning",
        "description": "Preparation to the capstone class - planning and coordination" 
    },
    {
        "title": "Reasoning with Logic",
        "description": "Class teaching to use logic to describe and assess arguments." 
    },
    {
        "title": "Computer Science Capstone",
        "description": "CST 499 - Computer Science Capstone is dedicated fully to the creation of full-fledged application that is a capstone of the C.S. program at CSUMB" 
    }
]